turbq/atprog/packs/atmel/SAM4N_DFP/1.0.49/atdf/ATSAM4N16C.atdf
      <value-group caption="" name="PWM_MR__PREB">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
      </value-group>
      <value-group caption="" name="PWM_CMR0__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR1__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR2__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR3__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
    </module>
    <module caption="Reset Controller" name="RSTC" version="11009D">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Peripheral Reset" mask="0x00000004" name="PERRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="System Reset Key" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP" values="RSTC_SR__RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="External Reset Length" mask="0x00000F00" name="ERSTL"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_MR__KEY"/>
        </register>
      </register-group>
      <value-group caption="" name="RSTC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="RSTC_SR__RSTTYP">
        <value caption="First power-up Reset" name="GeneralReset" value="0x0"/>
        <value caption="Return from Backup Mode" name="BackupReset" value="0x1"/>
        <value caption="Watchdog fault occurred" name="WatchdogReset" value="0x2"/>
        <value caption="Processor reset required by the software" name="SoftwareReset" value="0x3"/>
        <value caption="NRST pin detected low" name="UserReset" value="0x4"/>
      </value-group>
      <value-group caption="" name="RSTC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
