turbq/atprog/packs/atmel/SAM4N_DFP/1.0.49/atdf/ATSAM4N16C.atdf
      <value-group caption="" name="SUPC_WUIR__WKUPT6">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT7">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT8">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT9">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT10">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT11">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT12">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT13">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT14">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT15">
        <value caption="a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="a high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPS">
        <value caption="no wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="at least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMWS">
        <value caption="no wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="at least one wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BODRSTS">
        <value caption="no core brownout rising edge event has been detected since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="at least one brownout output rising edge event has been detected since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMRSTS">
        <value caption="no supply monitor detection has generated a core reset since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="at least one supply monitor detection has generated a core reset since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMS">
        <value caption="no supply monitor detection since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="at least one supply monitor detection since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
